# Combine Multiple DataFrames

In [ ]:
1) concatenation- we can combine any number of dataframes at a time
2) merging      - we can only combine two dataframes at a time

# 1) concatenation

Two approaches:
a) concat by rows   - we look for the common column labels. And if there is a common column label, we only write it once in the result
b) concat by columns- we look for the common rows labels. And if there is a common row label, we only write it once in the result

In [2]:
import pandas as pd

In [6]:
data1=pd.DataFrame({"First":[1,2],"Second":[3,4]},index=["A","B"])

In [7]:
data2=pd.DataFrame({"Third":[5,6],"Fourth":[7,8]},index=["A","B"])

In [8]:
data1

   First  Second
A      1       3
B      2       4

In [9]:
data2

   Third  Fourth
A      5       7
B      6       8

As a first argument in the concat function, we need to pass a list of dataframes that we want to combine

In [ ]:
The result that you get after concatenation is in the form of dataframe

In [10]:
pd.concat([data1,data2],axis="rows")

   First  Second  Third  Fourth
A    1.0     3.0    NaN     NaN
B    2.0     4.0    NaN     NaN
A    NaN     NaN    5.0     7.0
B    NaN     NaN    6.0     8.0

In [11]:
data2=pd.DataFrame({"First":[5,6],"Second":[7,8]},index=["A","B"])

In [12]:
data1

   First  Second
A      1       3
B      2       4

In [13]:
data2

   First  Second
A      5       7
B      6       8

In [14]:
pd.concat([data1,data2],axis="rows")

   First  Second
A      1       3
B      2       4
A      5       7
B      6       8

In [15]:
data1

   First  Second
A      1       3
B      2       4

In [16]:
data2=pd.DataFrame({"Third":[5,6],"Fourth":[7,8]},index=["A","B"])

In [17]:
data1

   First  Second
A      1       3
B      2       4

In [18]:
data2

   Third  Fourth
A      5       7
B      6       8

In [19]:
pd.concat([data1,data2],axis="columns")

   First  Second  Third  Fourth
A      1       3      5       7
B      2       4      6       8

In [20]:
data2=pd.DataFrame({"Third":[5,6],"Fourth":[7,8]},index=["C","D"])

In [21]:
data1

   First  Second
A      1       3
B      2       4

In [22]:
data2

   Third  Fourth
C      5       7
D      6       8

In [24]:
pd.concat([data1,data2],axis="columns")

   First  Second  Third  Fourth
A    1.0     3.0    NaN     NaN
B    2.0     4.0    NaN     NaN
C    NaN     NaN    5.0     7.0
D    NaN     NaN    6.0     8.0

# 2) merging

In [ ]:
merge function
parameters:
a) on= pass a labels of the common columns on which you want to merge
b) how= "inner","outer","left","right"

In [ ]:
inner join- get only those entries that are common in both dataframes

In [25]:
data1=pd.DataFrame({"id":[1,2,3,4,5],"Name":["Alex","Amy","Allen","Alice","Ayoung"],
                    "subject_id":["sub1","sub2","sub3","sub5","sub7"]})

In [26]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [27]:
data2=pd.DataFrame({"id":[6,2,3,7,8],"Name":["Saurav","Amy","Allen","Silam","Onkar"],
                    "subject_id":["sub8","sub1","sub3","sub6","sub9"]})

In [28]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [29]:
data2

   id    Name subject_id
0   6  Saurav       sub8
1   2     Amy       sub1
2   3   Allen       sub3
3   7   Silam       sub6
4   8   Onkar       sub9

In [ ]:
inner join- get only those entries that are common in both dataframes

In [30]:
pd.merge(data1,data2,on="Name",how="inner")

   id_x   Name subject_id_x  id_y subject_id_y
0     2    Amy         sub2     2         sub1
1     3  Allen         sub3     3         sub3

In [31]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [32]:
data2

   id    Name subject_id
0   6  Saurav       sub8
1   2     Amy       sub1
2   3   Allen       sub3
3   7   Silam       sub6
4   8   Onkar       sub9

In [33]:
pd.merge(data1,data2,on=["id","Name"],how="inner")

   id   Name subject_id_x subject_id_y
0   2    Amy         sub2         sub1
1   3  Allen         sub3         sub3

In [34]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [35]:
data2

   id    Name subject_id
0   6  Saurav       sub8
1   2     Amy       sub1
2   3   Allen       sub3
3   7   Silam       sub6
4   8   Onkar       sub9

In [36]:
pd.merge(data1,data2,on=["id","Name","subject_id"],how="inner")

   id   Name subject_id
0   3  Allen       sub3

inner join- get only those entries that are common in both dataframes
left join- get entries that are common in both dataframes, or those entries that are only present in the left dataframe
right join-get entries that are common in both dataframes, or entries that are only present in the right dataframe
outer join- get entries that are common in both dataframes,or those entries that are only present in the left dataframe or also those entries that are only present in the right dataframe

In [37]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [38]:
data2

   id    Name subject_id
0   6  Saurav       sub8
1   2     Amy       sub1
2   3   Allen       sub3
3   7   Silam       sub6
4   8   Onkar       sub9

In [39]:
pd.merge(data1,data2,on="Name",how="left")

   id_x    Name subject_id_x  id_y subject_id_y
0     1    Alex         sub1   NaN          NaN
1     2     Amy         sub2   2.0         sub1
2     3   Allen         sub3   3.0         sub3
3     4   Alice         sub5   NaN          NaN
4     5  Ayoung         sub7   NaN          NaN

In [40]:
data1

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub5
4   5  Ayoung       sub7

In [41]:
data2

   id    Name subject_id
0   6  Saurav       sub8
1   2     Amy       sub1
2   3   Allen       sub3
3   7   Silam       sub6
4   8   Onkar       sub9

In [42]:
pd.merge(data1,data2,on=["id","Name"],how="left")

   id    Name subject_id_x subject_id_y
0   1    Alex         sub1          NaN
1   2     Amy         sub2         sub1
2   3   Allen         sub3         sub3
3   4   Alice         sub5          NaN
4   5  Ayoung         sub7          NaN